tap "caskroom/cask"
tap "homebrew/bundle"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"

# fonts
cask "font-hack-nerd-font"
cask "font-fira-code"
cask "font-martian-mono"
cask "font-monaspace"

# languages and tools
brew "tokei"
brew "fnm"
brew "nvm"
brew "go"
brew "maven"
brew "pyenv"
brew "coreutils"

# chat
cask "signal"
cask "telegram"
cask "viber"

# mac specific
brew "mas"
cask "rectangle"
cask "stats"
cask "lunar"
cask "trex" # OCR
cask "hammerspoon"
cask "karabiner-elements"
cask "monitorcontrol"
cask "raycast"
cask "alt-tab"
cask "little-snitch"
cask "bartender"
cask "contexts"
cask "little-snitch"

# git
brew "difftastic"
brew "gh"
brew "git-quick-stats"
brew "onefetch"

# api
brew "hurl"
cask "bruno"
cask "postman"

# terminal
cask "iterm2" # main terminal
cask "ghostty" # fast but i need search
# terminal cli
brew "curl"
brew "fd"
brew "jq"
cask "session-manager-plugin"
brew "neofetch"
brew "starship"

# media
cask "obs"
cask "eagle"
cask "flameshot"
cask "zoom"
cask "vlc"
cask "qview"

# audio
cask "spotify"
cask "loopback"
cask "soundsource"
cask "audio-hijack"
brew "cava"

# files
cask "commander-one"
brew "rclone"
brew "rsync"
cask "insync"
cask "sublime-merge"
cask "sublime-text"
cask "visual-studio-code"
cask "obsidian"


## database
brew "redis"
brew "sqlite"
cask "another-redis-desktop-manager"
cask "dbeaver-community"
cask "tableplus"
cask "db-browser-for-sqlite"

# misc
cask "espanso"
brew "nginx", restart_service: true
brew "postgresql@14"
brew "scrcpy"
cask "switchhosts"
cask "vivaldi"
cask "wkhtmltopdf"
cask "raspberry-pi-imager"

# git
vscode "eamodio.gitlens"
vscode "quentinguidee.gitignore-ultimate"
vscode "ryu1kn.partial-diff"
# github
vscode "github.vscode-github-actions"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "me-dutour-mathieu.vscode-github-actions"
# files
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "redhat.vscode-yaml"
vscode "jock.svg"
# javascript
vscode "dbaeumer.vscode-eslint"
vscode "vitest.explorer"
vscode "bradlc.vscode-tailwindcss"
vscode "esbenp.prettier-vscode"
# vscode "kisstkondoros.vscode-codemetrics"
# docker
vscode "docker.docker"
vscode "ms-azuretools.vscode-docker"
vscode "ms-azuretools.vscode-containers"
vscode "p1c2u.docker-compose"
# python
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "detachhead.basedpyright"
vscode "ms-python.vscode-python-envs"
# markdown
vscode "kejun.markdown-alert"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-checkbox"
vscode "takumii.markdowntable"
vscode "renathossain.markdown-runner"
vscode "unifiedjs.vscode-mdx"
vscode "stateful.runme"
# misc
vscode "astro-build.astro-vscode"
vscode "gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "wakatime.vscode-wakatime"
vscode "qwtel.sqlite-viewer"
