tap "caskroom/cask"
tap "buo/cask-upgrade"
tap "koekeishiya/formulae"

# fonts
cask "font-jetbrains-mono" # used in obsidian
cask "font-jetbrains-mono-nerd-font" # used in iterm2 form icons
cask "font-hack-nerd-font" # used in vscode terminal
cask "font-fira-code"
cask "font-martian-mono"
cask "font-monaspace"
cask "font-cascadia-code"

# languages and tools
brew "fnm" # Node.js version manager (installs prebuild binary)
brew "nvm" # for work
brew "go"
brew "maven" # for work
brew "pyenv" # Python version management
brew "coreutils"

# mac specific
cask "rectangle" # Move and resize windows in macOS using keyboard shortcuts or snap areas
cask "stats" # system monitor in your menu bar
cask "lunar" # displays brightness
cask "hammerspoon" # automation of macOS (required by rcmd)
cask "jordanbaird-ice" # Hides menu bar icons
cask "contexts" # better Command-Tab
cask "little-snitch" # network monitoring
brew "mas" # Mac App Store command line interface
cask "processspy" # aggregate memory usages by process
cask "pearcleaner" # app cleaner
cask "karabiner-elements" # keyboard customizer for tilda in EU magic keyboard
cask "logi-options+" # to set smooth scroll for mx master mouse
cask "orbstack" # docker client

# git
brew "git" # fresh and faster than default installed
brew "gh" # github cli
brew "difftastic" # a structural diff that understands syntax
brew "git-quick-stats" # access various statistics in git repository
brew "tokei" # show the number of files, total lines within those files and code, comments

# api
cask "bruno" # local first API testing
cask "postman"

# terminal
cask "iterm2" # main terminal (supports nerd fonts unlike default mac terminal)
cask "ghostty" # fast but i need search

# terminal cli
brew "fzf" # fuzzy finder (use **<TAB> for completion)
brew "neovim"
brew "lazygit" # terminal UI for git
# brew "neovide" # Neovim GPU Client (smooth, animation) (miss app in application folder)
brew "micro" # editor
brew "bat" # cat alternative
brew "eza" # ls alternative
brew "sheldon" # shell plugin manager
brew "stow" # symlink farm manager
brew "curl"
brew "yt-dlp" # command-line audio/video downloader
brew "jq" # command-line JSON processor
brew "zoxide" # a smarter cd command
cask "session-manager-plugin" # aws
brew "starship" # prompt for shel
brew "fastfetch" # neofetch like system information tool

# media
cask "obs"
cask "eagle" # organize photos
cask "zoom"
cask "vlc"
cask "pika" # colour picker
cask "cleanshot" # screenshot tool with self-timer and ocr

# audio
cask "spotify"
cask "loopback" # Cable-free audio routing
cask "soundsource" # sound control per app
cask "audio-hijack" # recording
brew "cava" # cross-platform audio visualizer

# files, notes
cask "commander-one" # file manager with dual-pane interface
brew "rsync" # file copying tool for both remote and local files
cask "insync" # Google Drive, OneDrive, and Dropbox sync
cask "sublime-merge"
cask "sublime-text"
cask "visual-studio-code"
cask "obsidian" # personal notes, journaling, knowledge bases, and project management,

# database
brew "redis"
brew "sqlite"
cask "another-redis-desktop-manager"
cask "dbeaver-community" # cross-platform database tool
cask "tableplus" # database management
cask "db-browser-for-sqlite"

# browsers
cask "google-chrome" # for work
cask "microsoft-edge" # personal browser with pinned tabs not being scrollable in vertical view
cask "vivaldi" # emoji doesn't woks
cask "firefox@developer-edition" # use sometimes with sidebery

# chat
cask "telegram"
cask "viber"

# misc
cask "espanso" # text expander
cask "typinator" # espanso stoped working
brew "nginx", restart_service: true
brew "postgresql@14"
brew "scrcpy" # display and control your Android device
cask "wkhtmltopdf" # for work
cask "raspberry-pi-imager"

# ------------------------------------------------------------------------------
#  VSCode extensions
# ------------------------------------------------------------------------------
# git
vscode "eamodio.gitlens"
vscode "quentinguidee.gitignore-ultimate"
vscode "ryu1kn.partial-diff"
# github
vscode "github.vscode-github-actions"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "me-dutour-mathieu.vscode-github-actions"
# files
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "redhat.vscode-yaml"
vscode "jock.svg"
# javascript
vscode "dbaeumer.vscode-eslint"
vscode "vitest.explorer"
vscode "bradlc.vscode-tailwindcss"
vscode "esbenp.prettier-vscode"
# vscode "kisstkondoros.vscode-codemetrics"
# docker
vscode "docker.docker"
vscode "ms-azuretools.vscode-docker"
vscode "ms-azuretools.vscode-containers"
vscode "p1c2u.docker-compose"
# python
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "detachhead.basedpyright"
vscode "ms-python.vscode-python-envs"
# markdown
vscode "kejun.markdown-alert"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-checkbox"
vscode "takumii.markdowntable"
vscode "renathossain.markdown-runner" # run js in markdown
vscode "unifiedjs.vscode-mdx"
vscode "stateful.runme" # run js in markdown like in Notebooks
# misc
vscode "ms-vscode-remote.remote-ssh" # remote Development via ssh
vscode "astro-build.astro-vscode"
vscode "gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "wakatime.vscode-wakatime"
vscode "qwtel.sqlite-viewer"
vscode "bruno-api-client.bruno"
# vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "pomdtr.excalidraw-editor"

# ------------------------------------------------------------------------------
# App Store applications
# ------------------------------------------------------------------------------
mas "Home Assistant", id: 1099568401
mas "rcmd", id: 1596283165 # Switch apps instantly using the ⌘ Right Command key
mas "Velja", id: 1607635845 # browser picker
mas "DaisyDisk", id: 411643860
