astro-build.astro-vscode
bbenoist.nix
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
bradlc.vscode-tailwindcss
dbaeumer.vscode-eslint
detachhead.basedpyright
docker.docker
eamodio.gitlens
esbenp.prettier-vscode
github.copilot
github.copilot-chat
github.vscode-github-actions
gruntfuggly.todo-tree
humao.rest-client
jock.svg
kejun.markdown-alert
me-dutour-mathieu.vscode-github-actions
meta.pyrefly
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-python-envs
p1c2u.docker-compose
quentinguidee.gitignore-ultimate
qwtel.sqlite-viewer
redhat.vscode-yaml
ryu1kn.partial-diff
shd101wyy.markdown-preview-enhanced
takumii.markdowntable
tamasfe.even-better-toml
tomoki1207.pdf
unifiedjs.vscode-mdx
vitest.explorer
wakatime.vscode-wakatime
wix.glean
